let a = `2022.01.30 資本主義就是這個概念.mp3
2022.02.01 沒中的失望叫聲完整.mp3
2022.02.01 沒中的失望叫聲沒有.mp3
2022.03.10 什麼音容宛在 我還在.mp3
2022.03.23 電腦王.mp3
2022.08.06 啊算了.mp3
2022.08.06 當你不給我罐罐吃的時候.mp3
2022.10.02 【早安洛可起床了嗎】雜談！來聊聊這個禮拜做了甚麼吧！首先我要先起床。【洛可洛斯特 _ VTUBER】 (1080p_30fps_H264-128kbit_AAC) 02_01_08-02_01_18.mp3
2022.10.12 嗯 什麼東西.mp3
2022.10.31 什麼叫做讓你的心也跟著南瓜.mp3
2022.10.31 可是我有點忘記我本來長怎樣了.mp3
2022.10.31 媽媽我要回家啊.mp3
2022.10.31 感覺不到愛.mp3
2022.10.31 我們的愛還有嗎.mp3
2022.10.31 毫無感情全是技術.mp3
2022.10.31 第幾次了第幾次了.mp3
2022.11.21 E 幹.mp3
2022.11.25 啊... 我的水噴出來了.mp3
2022.11.25 終製做著作.mp3
2022.12.05 哇打戲卡哇伊底.mp3
2022.12.05 快點說我可愛.mp3
2022.12.05 我看起來像是會拋棄你們的人嗎？我那麼重情重義.mp3
2022.12.05 欸你們每個都有被我盯梢的感覺.mp3
2022.12.05 欸我覺得好噁心喔.mp3
2022.12.05 每個都有被我盯梢的感覺.mp3
2022.12.09 你以為我現在開台是為了什麼.mp3
2022.12.09 完蛋了手機忘記充電了.mp3
2022.12.09 我沒有變胖好嗎.mp3
2022.12.09 阿罵你怎麼在這裡.mp3
2022.12.10 半夜你們這樣噁不噁心阿.mp3
2022.12.10 各位安安洛可洛斯特.mp3
2022.12.10 我要睡覺.mp3
2022.12.10 絕對沒有在臭的意思.mp3
2022.12.10 葉黃素精華凍.mp3
2022.12.11 哼馬的醬尼哼(會限).mp3
2022.12.12 LOCO醬.mp3
2022.12.12 貓御子你要不要聽聽看你在公三小.mp3
2022.12.16 OK~.mp3
2022.12.16 嘿我們有有鳥了.mp3
2022.12.16 嘿有鳥你怎麼在這裡.mp3
2022.12.16 奧OK~.mp3
2022.12.16 然後有鳥就跑進來了.mp3
2022.12.16 這樣子有鳥就會飛進來了.mp3
2022.12.17 有鳥女裝謝謝.mp3
2022.12.21 他艾莉卡一臉不愛我.mp3
2022.12.21 你就一直在笑.mp3
2022.12.21 你相信艾莉卡.mp3
2022.12.21 你確定 Are you sure.mp3
2022.12.21 媽媽說我這個有85分幹可是賣相0分.mp3
2022.12.21 差不多啦切一切反正都是瓜.mp3
2022.12.21 我拿這盤去給我媽吃他會說好吃.mp3
2022.12.21 我的手收我的手收.mp3
2022.12.21 我要去找我媽媽.mp3
2022.12.21 我覺得他離我的理想越來越遠.mp3
2022.12.21 我說他是櫛瓜他就是櫛瓜.mp3
2022.12.21 我跟你講啦加薪就是為了今天.mp3
2022.12.21 櫛瓜暫定.mp3
2022.12.21 欸我的手看起來很好吃欸.mp3
2022.12.21 理想就像天井一樣.mp3
2022.12.21 艾莉卡他一臉不愛我她好好笑他一臉不愛我.mp3
2022.12.21 要不要相信你阿罵.mp3
2022.12.21 請問你還好嗎.mp3
2022.12.21 這個月加薪就是為了今天.mp3
2022.12.21 這就是我阿罵會做給我的菜.mp3
2022.12.21 這籽挖起來好好玩喔.mp3
2022.12.21 馬麻.mp3
2022.12.21 馬麻2.mp3
2022.12.24 蘿可洛可你快去做封面呃啊啊啊.mp3
2022.12.25 蘿可 喵滿意了嗎那就這個樣子.mp3
2022.12.25 蘿可 滿意了嗎.mp3
2022.12.25 蘿可 那就這個樣子.mp3
2022.12.26 蘿可唱罵倒生日快樂.mp3
2022.12.27 我回來了抱歉並沒有幹.mp3
2022.12.31 你們為什麼這麼喜歡微笑小香香.mp3
2022.12.31 強制插入聽起來好色喔笑聲.mp3
2022.12.31 我要漲價.mp3
2022.12.31 早餐單單子傳下去啊不要.mp3
2022.12.31 總之先拿個面具遮一下啊.mp3
2022.12.31 要不要漲價.mp3
2022.12.31 這是一種放置play嗎.mp3
2023.01.01 一直抽一直爽.mp3
2023.01.01 不好了不好了不要再微笑小香香.mp3
2023.01.01 凶快點出來我要笑他.mp3
2023.01.01 各位新年快樂.mp3
2023.01.01 地球只有一個但山上有鳥有兩個.mp3
2023.01.01 夠了沒有夠了沒有好喔.mp3
2023.01.01 大吉的機率比較低捏.mp3
2023.01.01 太扯了.mp3
2023.01.01 山上有鳥有兩個FUCK.mp3
2023.01.01 山上有鳥有兩個阿阿阿.mp3
2023.01.01 幹!日常.mp3
2023.01.01 幹山上有鳥真的有兩個.mp3
2023.01.01 幹有鳥又大吉.mp3
2023.01.01 幹有鳥又大吉有鳥又寶二.mp3
2023.01.01 是凶! 是凶!.mp3
2023.01.01 有我的大吉跟艾莉卡的大吉.mp3
2023.01.01 有鳥又寶二什麼東西阿.mp3
2023.01.01 欸你們可以不要再大吉了.mp3
2023.01.01 欸對順帶一提.mp3
2023.01.01 欸念這個很累欸.mp3
2023.01.01 欸怎麼都沒有凶.mp3
2023.01.01 欸我發現沒有凶欸.mp3
2023.01.01 看到吉我就很害怕.mp3
2023.01.01 等一下等一下等一下.mp3
2023.01.01 這是大吉限時UP.mp3
2023.01.01 阿哩嘎都痾阿阿阿.mp3
2023.01.28 蘿可下去給我當烤鴨.mp3
2023.01.28 蘿可你們進來的記得按讚訂閱.mp3
2023.01.28 蘿可好然後.mp3
2023.01.28 蘿可忽老每次跟洛可owo的時候都有詐.mp3
2023.01.28 蘿可我是個聰明的七歲.mp3
2023.01.28 蘿可所以是五碼神奇龍彥!!.mp3
2023.01.28 蘿可為了洛可頻道我是不會脫光的 噁不噁心阿.mp3
2023.01.28 蘿可罵倒.mp3
2023.01.28 蘿可踩踩.mp3
2023.01.28 蘿可逮捕三問.mp3
2023.01.28 蘿可離婚三問.mp3
2023.02.07 對不起啦.mp3
2023.02.07 我的笑點微弱.mp3
2023.02.07 自我介紹.mp3
2023.02.07 配兔兔好累喔.mp3
2023.03.13 總之他投了很多.mp3
2023.03.13 這是個什麼概念啊各位.mp3
2023.04.04 蘿可罵你.mp3
2023.04.04 蘿可變態王八蛋.mp3
2023.04.22 洛姐 1洗洗睡吧，夢裡什麼都有.mp3
2023.04.22 洛姐 2睡吧 夢裡什麼都有.mp3
2023.04.22 洛姐 3還是去睡覺吧 節錄.mp3
2023.04.22 洛姐 3還是去睡覺吧.mp3
2023.04.22 洛姐 4有鳥SC睡覺 節錄.mp3
2023.04.22 洛姐 4有鳥SC睡覺.mp3
2023.04.22 洛姐 山上有鳥.mp3
2023.04.29 我愛你們.mp3
2023.04.29 我跟我媽的概念是.mp3
2023.05.07 只要捅下去你就永遠留下來 病嬌台詞.mp3
2023.05.07 把餔把餔.mp3
2023.05.07 甲飽緊睏.mp3
2023.05.07 跟大家講個鬼故事 明天星期一.mp3
2023.05.07 還是你們只想要把餔把餔.mp3
2023.05.09 後空翻! 後空翻! 後空翻!.mp3
2023.05.09 我們經費要去跟誰請.mp3
2023.05.09 我看起來像是會後空翻的人嗎.mp3
2023.05.13 他沒有身體~~~.mp3
2023.05.15 佛心公司.mp3
2023.05.15 你搞毛阿這個.mp3
2023.05.15 噢 我不太想看你上廁所.mp3
2023.05.15 學長你倒是告訴我一下怎麼又是學長.mp3
2023.05.15 無情工商.mp3
2023.05.15 純讚 大拇指.mp3
2023.05.20 七歲沒有人權.mp3
2023.05.20 欸路上小心.mp3
2023.05.24 正直的金孫滿兩個月了 小李子你不要那麼大聲說你是蘿莉控.mp3
2023.05.24 鈴芽之旅中文咒語.mp3
2023.06.04 反正都有人可以365天生日了.mp3
2023.06.06 下次一定還敢.mp3
2023.06.06 人呢我要BAN他.mp3
2023.06.06 可憐阿(台語).mp3
2023.06.06 回來了沒有可憐阿(台語).mp3
2023.06.06 完了Henry不會講話.mp3
2023.06.06 白湯繼續開六小時阿.mp3
2023.06.17 請看VCR.mp3
2023.06.23 我太難了.mp3
2023.09.18 ㄌㄐ東西!!.mp3
2023.09.18 下面一位~.mp3
2023.09.18 來聊天室 醒.mp3
2023.09.18 都是這些東西.mp3
2023.09.23 喔是喔.mp3
2023.09.23 這都是些什麼東西.mp3`



let b = `2022.01.30 喵~~~~.mp3
2022.01.30 汪~~~~.mp3
2022.02.01 dudududu.mp3
2022.02.01 打噴嚏.mp3
2022.02.06 niconiconico(蘿可).mp3
2022.03.10 我還沒死.mp3
2022.08.06 pekopeko.mp3
2022.08.06 喵喵喵.mp3
2022.08.06 喵喵喵喵喵~.mp3
2022.08.06 用貓喵語說話.mp3
2022.12.05 哼.mp3
2022.12.05 喵.mp3
2022.12.09 喝水的砸口聲.mp3
2022.12.09 阿罵無奈的嘆氣.mp3
2022.12.10 咻咻噗~.mp3
2022.12.10 哈阿.mp3
2022.12.10 我伸一下懶腰.mp3
2022.12.10 聽了就很開心的笑聲.mp3
2022.12.12 nananana.mp3
2022.12.12 喵喵喵.mp3
2022.12.21 EEEEE.mp3
2022.12.21 嗚呼(挖籽).mp3
2022.12.21 嗚呼.mp3
2022.12.21 嗚呼嗚呼.mp3
2022.12.21 嗚呼嗚呼1.mp3
2022.12.21 嗚嗚嗚嗚哇.mp3
2022.12.21 嗚嗚幹嘛啦.mp3
2022.12.21 發現洋蔥全切了的慘叫.mp3
2022.12.25 DX5MA.mp3
2022.12.25 DX5MA2.mp3
2022.12.25 蘿可 喵.mp3
2022.12.31 喔喔喔哦哦哦.mp3
2022.12.31 斯斯斯.mp3
2023.01.01 壓打壓打.mp3
2023.01.01 笑聲 讚.mp3
2023.01.01 蛤蛤蛤蛤蛤.mp3
2023.01.01 阿罵的喘氣聲.mp3
2023.01.21 喵~.mp3
2023.02.07 ㄎ一ㄚㄎ一ㄚㄎ一ㄚ.mp3
2023.02.07 屑屑的笑聲.mp3
2023.02.07 幹!.mp3
2023.02.28 對對對對YESYESYES.mp3
2023.04.05 喵叫 短.mp3
2023.04.05 喵叫 長.mp3
2023.04.05 喵短2.mp3
2023.04.05 喵長短2.mp3
2023.04.19 幹!.mp3
2023.05.15 1#$%#$ 女鬼橋.mp3
2023.05.15 剛剛有東西飛過去啦.mp3
2023.05.15 哦~.mp3
2023.05.15 喔 幹.mp3
2023.05.15 嗨 孔子.mp3
2023.05.15 後面有一個jump scare.mp3
2023.05.15 看文耀慘死的慘叫.mp3
2023.05.15 看監視器的慘叫.mp3
2023.05.15 舒爽 靠.mp3
2023.05.15 阿罵看後面的慘叫.mp3
2023.05.15 靠.mp3
2023.05.20 Henry喵.mp3
2023.05.20 亂喵.mp3
2023.05.20 喵 It's me.mp3
2023.05.20 喵.mp3
2023.05.20 日常喵.mp3
2023.05.20 路牧喵.mp3
2023.05.20 踢到鍵盤的慘叫.mp3
2023.06.06 RRRRRRRRR.mp3
2023.06.06 ㄏㄏ2ㄏ2ㄏ2ㄏ.mp3
2023.06.06 喵喵喵喵.mp3
2023.06.06 打哈欠.mp3
2023.06.06 打噴嚏.mp3`

// 先整理檔名
a = a.split('\n').map((v) => v.trim()).filter((v) => v).map((v) => '台詞MP3/' + v);

b = b.split('\n').map((v) => v.trim()).filter((v) => v).map((v) => '音效MP3/' + v);

console.log(a.length, b.length);

$(() => {
  // 建立按鈕
  let main = document.getElementById('main');

  let header = document.createElement('h2');
  header.innerText = '台詞';
  main.append(header);
  a.forEach(element => {
    let btn = document.createElement('button');
    btn.innerText = element;
    btn.classList.add('button');
    btn.dataset.sound = element;
    main.append(btn);
  });

  let header2 = document.createElement('h2');
  header2.innerText = '音效';
  main.append(header2);
  b.forEach(element => {
    let btn = document.createElement('button');
    btn.innerText = element;
    btn.classList.add('button');
    btn.dataset.sound = element;
    main.append(btn);
  });

  // 預先讀取所有mp3
  let keybinds = {};
  let sounds = [];
  let progressCount = 0;

  $('.button').each(function() {
    let { sound, loop, keybind } = this.dataset;
    sound = new Audio(`./sounds/${sound}`);
    sound.addEventListener('canplaythrough', () => {
      progressCount++;
      showProgress();
    });
    sounds.push(sound);

    sound.loop = typeof loop !== 'undefined';
    this.sound = sound;

    if (keybind) {
      keybinds[keybind.toLowerCase()] = this;
    }
  });

  // 讀取進度顯示
  function showProgress() {
    let progressText = document.getElementById('progressText');
    let progressTotal = sounds.length;
    if(progressCount === progressTotal) {
      progressText.innerText = `讀取完成`;
      return;
    }
    progressText.innerText = `讀取中... (${progressCount}/${progressTotal})`;
  }



  // $(document).keyup((e) => {
  //   let keybind = keybinds[e.key];
  //   if (keybind) {
  //     keybind.click();
  //   }
  // })

  $('.button').click(async function() {
    let loop = this.sound.loop;
    // 如果是loop模式且在播放中，則停止播放
    if (loop && !this.sound.paused) {
      // 移除class，讓按鈕恢復原狀
      this.classList.remove('active');
      this.sound.pause();
      return;
    }

    // 加上class，讓按鈕有按下的感覺
    this.classList.add('active');

    this.sound.currentTime = 0;
    await this.sound.play();

    if(!loop) {
      this.classList.remove('active');
    }

  })

})